# FeedThroughLugsIsOccupiedAndDisconnectOtherCircuits Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricalFailures..::..FeedThroughLugsIsOccupiedAndDisconnectOtherCircuits Property
BuiltInFailures..::..ElectricalFailures Class See Also
---
The feed through lugs is occupied, so other circuits connected with feed through lugs will be disconnected from this panel [Panel Name].
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FeedThroughLugsIsOccupiedAndDisconnectOtherCircuits { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FeedThroughLugsIsOccupiedAndDisconnectOtherCircuits As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FeedThroughLugsIsOccupiedAndDisconnectOtherCircuits {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricalFailures Class
Autodesk.Revit.DB Namespace